{
  "title": "Resume",
  "language": {
    "title": "Language"
  },
  "profile": {
    "title": "Profile",
    "name": "Simon Chu",
    "profession": "Backend Engineer"
  },
  "about": {
    "title": "About",
    "motto": "Anyone can write code that a computer can understand,but good programmers write code that humans can understand. - Martin Fowler.",
    "autobiography": [
      "I am a backend engineer passionate about technological innovation and system optimization. With years of development experience, I specialize in leveraging my technical expertise to build efficient and scalable systems while focusing on enhancing system performance and optimizing development processes. I have accumulated extensive backend development experience in e-commerce, fintech, and ODM/OEM industries and excel in cross-team collaboration, task planning, and personnel management, ensuring smooth project execution and achieving expected outcomes.",
      "Beyond my work experience, I actively participate in technical communities and open-source contributions, exploring new technologies through personal development projects and continuously refining my engineering practices. I thrive on tackling challenging technical problems and driving innovative applications, aiming to apply my expertise to create superior digital experiences and generate meaningful value for society."
    ],
    "email": "simonchu0608@gmail.com",
    "linkedin": "https://www.linkedin.com/in/simon-chu-tw/",
    "github": "https://github.com/xchux",
    "twitter": "https://x.com/SimonCh00064398"
  },
  "workExperience": {
    "title": "Work Experience",
    "companies": [
      {
        "name": "Pinkoi",
        "icon": "pinkoi",
        "profile": "The Company is Asia's cross-border design product shopping platform. It is committed to providing a sustainable development platform for brands of all sizes, allowing creators to safely build brand value here, grow into an international design brand, and jointly create a design ecosystem that makes life better.",
        "position": "Backend Engineer",
        "duration": "2022/06 - 2024/12",
        "descriptions": [
          "Developed a digital product sales system using AWS Lambda within the free tier to handle file uploads, validation, and antivirus scanning, reducing server load and costs. Implemented a scheduling mechanism to automatically revoke download permissions for expired files.",
          "Managed product specification images by developing a feature to associate product specifications with corresponding images. Utilized context managers and Celery for asynchronous image cropping, improving thumbnail processing efficiency, and accelerated client-side loading via CDN.",
          "Optimized response rate calculation by collaborating with data engineers to define calculation formulas. Enhanced daily site-wide seller response rate computations through database indexing and data preprocessing.",
          "Developed and maintained the messaging center by implementing a real-time messaging system based on Socket.io. Focused on application-layer development, resolved disconnection handling, and improved garbage collection mechanisms to enhance system stability.",
          "Collaborated with the team to formulate annual plans and acceptance criteria, maximizing company benefits within limited resources and manpower",
          "Assisted junior engineers with system architecture planning, technical reviews, task breakdown, and time estimation to ensure smooth development progress.",
          "Reviewed business data charts and assisted in chart creation, ensuring data source accuracy and reliability."
        ]
      },
      {
        "name": "attittu_",
        "icon": "attittu_",
        "profile": "The company is committed to the global fintech sector and has launched a number of SAAS platform specifically for the legal industry, which are widely adopted by top law firms around the world.",
        "position": "Python Engineer",
        "duration": "2021/07 - 2022/04",
        "descriptions": [
          "Co-develop database sharding by vertical partitioning, responsible for python script which handle proxy switch and record result when master or slave DB updating.",
          "Develop service center by microservice architecture and dockerize that avoide some service blocked in china.",
          "Build unit test environment and refactor function to single responsibility which made easier for testing.",
          "Reduce duplicate I/O and using RabbitMQ, Celery, Asyncio for speed up. E.g. distribution system speed up 30%.",
          "In charge in backend develop and design architecture. At the same time, teaching junior develop and peer code review."
        ]
      },
      {
        "name": "Quanta",
        "icon": "quanta",
        "profile": "The company mainly provides OEM services and OEM electronic products for brand owners, and is one of the world's top 500 companies.",
        "position": "Software Engineer",
        "duration": "2019/01 - 2021/07",
        "descriptions": [
          "Developed python, bash and powershell scriptto extend system (Such as CI/CD pipline). During, develop and maintain 40 repository which increase testing coverage 5~10%.",
          "Developed server temperature monitoring system, framework using flask, processing data by concurrency and data visualize.",
          "Developed upgrade/downgrade flash tool, develop by python and connect to serial port and handle massive data by generator data analyize.",
          "Developed and maintained Linux / Windows hardware check and reduce I/O and optimize algorithm which speed up 20%."
        ]
      },
      {
        "name": "Addcn.com - Vip outlet",
        "icon": "addcn",
        "profile": "The company has created a variety of information matching platforms named with numbers (e.g. 591 Housing Transactions, 518 bearworks), and providing more convenient life-oriented services.",
        "position": "PHP Developer",
        "duration": "2018/07 - 2018/08",
        "descriptions": [
          "Developed Back-End management analysis function to generate sales reports for internal usage and data visualize.",
          "Added vendor warehouse management function for external users to manage warehouse more effectively and efficiently.",
          "Debugged and optimized website to provide better user experience."
        ]
      }
    ]
  },
  "project": {
    "title": "Project",
    "projects": [
      {
        "name": "Python Docs Translation",
        "profile": "Sciwork Project",
        "duration": "2024/05 - 2024/08",
        "descriptions": [
          "Transslate Python document to zh-TW with AI tool and manual fine-tune."
        ]
      },
      {
        "name": "Secret Chat",
        "profile": "Academia Sinica Project",
        "duration": "2018/03 - 2018/06",
        "descriptions": [
          "White-box and black-box testing android bluetooth communication, encryption and other functions.Record to testing document.",
          "Fixed Socket and Broadcast errors and reported to project owner."
        ]
      },
      {
        "name": "Teaching Assistant",
        "profile": "Web Programming",
        "duration": "2018/02 - 2018/06",
        "descriptions": [
          "Guided students to clarify and understand courses’ material and concept.",
          "Debugged students’ homework.",
          "Assisted the professor to prepare the course material."
        ]
      },
      {
        "name": "Wishar",
        "profile": "Public Wi-Fi automatic login system",
        "duration": "2014/09 - 2018/06",
        "descriptions": [
          "Learned data structure, algorithm, and software engineering.",
          "Participated in the 22nd National College College Information Application Service Innovation Competition and won the bronze medal.",
          "Participated in the 106th academic year \"Study Practice Simulation Learning Platform\" and won the TOP Maker."
        ]
      }
    ]
  },
  "education": {
    "title": "Education",
    "schools": [
      {
        "name": "National Taiwan Ocean University",
        "icon": "ntou",
        "duration": "2014/09 - 2018/06",
        "degree": "Bachelor of Computer Science and Information Engineering"
      },
      {
        "name": "Huajiang High School",
        "icon": "hcsh",
        "duration": "2011/09 - 2014/06",
        "degree": "Ordinary class"
      }
    ]
  },
  "skills": {
    "title": "Skills",
    "frontend": {
      "title": "Frontend"
    },
    "backend": {
      "title": "Backend"
    },
    "data": {
      "title": "Data"
    },
    "devOps": {
      "title": "DevOps"
    }
  },
  "awards": {
    "title": "Awards",
    "projects": [
      {
        "name": "Wishar",
        "competitions": [
          {
            "name": "2017 22nd National College College Information Application Service Innovation Competition",
            "ranking": "Bronze medal"
          },
          {
            "name": "106th academic year \"Study Practice Simulation Learning Platform\"",
            "ranking": "TOP Maker"
          }
        ]
      },
      {
        "name": "Weather Tour",
        "competitions": [
          {
            "name": "2017 National College College Software Creation Competition",
            "ranking": "Honorable Mention"
          },
          {
            "name": "2017 Open Source Software Creative Design Competition",
            "ranking": "Honorable Mention"
          },
          {
            "name": "2017 Smart Terminal and Human-Computer Interaction Software Creation Competition",
            "ranking": "Honorable Mention"
          },
          {
            "name": "National Taiwan Ocean University 106 Annual Special Competition",
            "ranking": "Silver medal"
          }
        ]
      }
    ]
  }
}